a:3:{s:4:"time";i:1504765921;s:3:"ttl";i:600;s:5:"value";a:5:{s:8:"contacts";a:11:{s:4:"name";s:16:"Контакты";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:61:"//www.webasyst.com/wa-data/public/updates/img/33/133/icon.png";s:5:"icons";a:4:{i:96;s:67:"//www.webasyst.com/wa-data/public/updates/img/33/133/icon.96x96.png";i:48;s:67:"//www.webasyst.com/wa-data/public/updates/img/33/133/icon.48x48.png";i:24;s:67:"//www.webasyst.com/wa-data/public/updates/img/33/133/icon.24x24.png";i:16;s:67:"//www.webasyst.com/wa-data/public/updates/img/33/133/icon.16x16.png";}s:10:"commercial";b:0;s:7:"version";s:8:"1.1.6.20";s:12:"download_url";s:58:"http://www.webasyst.com/download/archive/wa-apps/contacts/";s:12:"requirements";a:1:{s:13:"app.installer";a:2:{s:7:"version";s:12:">=1.7.13.168";s:6:"strict";b:1;}}s:9:"changelog";a:3:{i:0;a:3:{s:7:"version";s:8:"1.1.6.20";s:7:"content";s:100:"Улучшение системы безопасности: включена защита от CSRF.";s:8:"datetime";s:19:"2017-07-31 12:21:00";}i:1;a:3:{s:7:"version";s:8:"1.1.5.15";s:7:"content";s:62:"Исправлены незначительные ошибки";s:8:"datetime";s:19:"2017-05-16 15:05:44";}i:2;a:3:{s:7:"version";s:8:"1.1.4.10";s:7:"content";s:158:"Улучшена совместимость с последней версией фреймворка и новым приложением «Команда».";s:8:"datetime";s:19:"2016-12-15 15:47:23";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}s:9:"installer";a:11:{s:4:"name";s:18:"Инсталлер";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:60:"//www.webasyst.com/wa-data/public/updates/img/53/53/icon.png";s:5:"icons";a:4:{i:96;s:66:"//www.webasyst.com/wa-data/public/updates/img/53/53/icon.96x96.png";i:48;s:66:"//www.webasyst.com/wa-data/public/updates/img/53/53/icon.48x48.png";i:24;s:66:"//www.webasyst.com/wa-data/public/updates/img/53/53/icon.24x24.png";i:16;s:66:"//www.webasyst.com/wa-data/public/updates/img/53/53/icon.16x16.png";}s:10:"commercial";b:0;s:7:"version";s:10:"1.7.13.168";s:12:"download_url";a:4:{s:17:"wa-apps/installer";s:59:"http://www.webasyst.com/download/archive/wa-apps/installer/";s:9:"wa-system";s:51:"http://www.webasyst.com/download/archive/wa-system/";s:10:"wa-content";s:52:"http://www.webasyst.com/download/archive/wa-content/";s:12:"wa-installer";s:54:"http://www.webasyst.com/download/archive/wa-installer/";}s:12:"requirements";a:6:{s:3:"php";a:2:{s:6:"strict";b:1;s:7:"version";s:4:">5.2";}s:8:"php.curl";a:2:{s:11:"description";s:43:"Get updates information from update servers";s:6:"strict";b:0;}s:22:"phpini.allow_url_fopen";a:3:{s:11:"description";s:43:"Get updates information from update servers";s:6:"strict";b:0;s:5:"value";i:1;}s:12:"php.mbstring";a:2:{s:6:"strict";b:1;s:5:"value";i:1;}s:29:"phpini.mbstring.func_overload";a:3:{s:11:"description";s:20:"Smarty properly work";s:6:"strict";b:1;s:5:"value";s:2:"<2";}s:94:"rights..|wa-installer|install.php|api.php|wa-log|wa-data/protected|wa-apps|wa-content|wa-cache";a:2:{s:11:"description";s:42:"Check folder rights for install and update";s:6:"strict";b:1;}}s:9:"changelog";a:22:{i:0;a:3:{s:7:"version";s:10:"1.7.13.168";s:7:"content";s:182:"— Повышение производительности для пользователей бекенда.<br>
— Исправлены незначительные ошибки.";s:8:"datetime";s:19:"2017-08-30 14:46:44";}i:1;a:3:{s:7:"version";s:10:"1.7.10.162";s:7:"content";s:79:"Исправлена страница настроек в Инсталлере.";s:8:"datetime";s:19:"2017-08-14 13:56:01";}i:2;a:3:{s:7:"version";s:9:"1.7.9.161";s:7:"content";s:63:"— Улучшение системы безопасности.";s:8:"datetime";s:19:"2017-08-14 13:04:14";}i:3;a:3:{s:7:"version";s:9:"1.7.8.160";s:7:"content";s:136:"— Улучшение системы безопасности.<br>
— Исправлены незначительные ошибки.";s:8:"datetime";s:19:"2017-08-09 15:08:24";}i:4;a:3:{s:7:"version";s:9:"1.7.7.158";s:7:"content";s:63:"— Улучшение системы безопасности.";s:8:"datetime";s:19:"2017-07-31 16:54:11";}i:5;a:3:{s:7:"version";s:9:"1.7.6.151";s:7:"content";s:216:"Исправлена ошибка в форме регистрации с элементом подтверждения согласия с политикой обработки персональных данных.";s:8:"datetime";s:19:"2017-07-06 19:34:34";}i:6;a:3:{s:7:"version";s:9:"1.7.5.147";s:7:"content";s:375:"Добавлены настройки формы регистрации для показа элементов подтверждения согласия с политикой обработки персональных данных. <a href="https://support.webasyst.ru/20302/webasyst-update-2017-personal-data-processing/">Инструкция по настройке</a>.";s:8:"datetime";s:19:"2017-06-29 15:44:14";}i:7;a:3:{s:7:"version";s:9:"1.7.4.142";s:7:"content";s:372:"— Добавлена поддержка типа данных UNSIGNED INT для полей таблиц базы данных.<br/>— Исправлено формирование URL в работе заданий CRON.<br/>— Исправлена ошибка CSRF-защиты при настройке виджетов панели управления Webasyst.";s:8:"datetime";s:19:"2017-05-31 17:26:37";}i:8;a:3:{s:7:"version";s:9:"1.7.3.139";s:7:"content";s:140:"Повышение стабильности работы и улучшение системы безопасности фреймворка.";s:8:"datetime";s:19:"2017-05-23 15:25:09";}i:9;a:3:{s:7:"version";s:9:"1.7.2.138";s:7:"content";s:63:"— Улучшение системы безопасности.";s:8:"datetime";s:19:"2017-05-22 17:30:53";}i:10;a:3:{s:7:"version";s:9:"1.7.1.136";s:7:"content";s:63:"— Улучшение системы безопасности.";s:8:"datetime";s:19:"2017-05-16 15:06:41";}i:11;a:3:{s:7:"version";s:9:"1.7.0.133";s:7:"content";s:408:"— Расширена функциональность для плагинов доставки.<br>
— Устранено излишнее логирование сообщений об ошибках 403 и 404.<br>
— Исправлена ошибка счетчика страниц в функции <code>{wa_pagination}</code>.<br>
— Улучшение системы безопасности.";s:8:"datetime";s:19:"2017-05-10 18:44:10";}i:12;a:3:{s:7:"version";s:10:"1.6.10.128";s:7:"content";s:160:"— Исправлен адаптер OAuth-авторизации через Facebook.<br>
— Исправлены незначительные ошибки.";s:8:"datetime";s:19:"2017-04-17 16:05:33";}i:13;a:3:{s:7:"version";s:9:"1.6.9.123";s:7:"content";s:58:"<p>
— Исправление ошибок в API.
</p>";s:8:"datetime";s:19:"2017-03-14 14:44:49";}i:14;a:3:{s:7:"version";s:9:"1.6.8.121";s:7:"content";s:211:"Для плагинов доставки добавлена поддержка настройки интервалов желаемой даты и времени доставки на выбор клиента.";s:8:"datetime";s:19:"2017-03-06 18:06:18";}i:15;a:3:{s:7:"version";s:9:"1.6.7.113";s:7:"content";s:67:"— Исправлены незначительные ошибки.";s:8:"datetime";s:19:"2017-02-09 13:18:44";}i:16;a:3:{s:7:"version";s:9:"1.6.6.111";s:7:"content";s:158:"— Поддержка авторизации по ключу API для Google Maps.<br>
— Исправлены незначительные ошибки.";s:8:"datetime";s:19:"2017-02-01 16:57:42";}i:17;a:3:{s:7:"version";s:9:"1.6.5.103";s:7:"content";s:167:"Добавлен перевод нескольких новых строк локализации.<br>
Исправлены незначительные ошибки.";s:8:"datetime";s:19:"2016-12-15 15:39:50";}i:18;a:3:{s:7:"version";s:8:"1.6.4.99";s:7:"content";s:104:"Исправлена работа раздела «Плагины» в приложении «Сайт»";s:8:"datetime";s:19:"2016-12-08 15:47:05";}i:19;a:3:{s:7:"version";s:8:"1.6.3.97";s:7:"content";s:543:"— Исправлена ошибка в загрузке новых записей в хронологии действий пользователя в приложении «Команда» и в «Ленте событий» панели управления Webasyst<br>
— Исправлена ошибка, проявлявшаяся при выборе получателей в приложении «Рассылки»<br>
— Исправлена ошибка в работе метода-хелпера <tt>{$wa->storage()}</tt>";s:8:"datetime";s:19:"2016-12-02 17:04:45";}i:20;a:3:{s:7:"version";s:8:"1.6.2.95";s:7:"content";s:112:"Исправлена совместимость с существующими версиями плагинов.";s:8:"datetime";s:19:"2016-12-01 15:52:14";}i:21;a:3:{s:7:"version";s:8:"1.6.1.94";s:7:"content";s:516:"— Исправлена ошибка проверки прав доступа, из-за которой не отображалось поле поиска покупателя в бекенде Shop-Script.<br>
— Устранено добавление лишних CSS-классов к многоуровневым спискам меню, сформированным с помощью функции <tt>wa_print_tree</tt>.<br>
— Исправлен редактор фотографии контакта.";s:8:"datetime";s:19:"2016-12-01 14:01:09";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}s:4:"shop";a:12:{s:4:"name";s:13:"Shop-Script 7";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:61:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.png";s:5:"icons";a:4:{i:96;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.96x96.png";i:48;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.48x48.png";i:24;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.24x24.png";i:16;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.16x16.png";}s:10:"commercial";b:1;s:7:"version";s:10:"7.2.13.140";s:12:"download_url";s:54:"http://www.webasyst.com/download/archive/wa-apps/shop/";s:12:"requirements";a:1:{s:13:"app.installer";a:2:{s:7:"version";s:12:">=1.7.13.168";s:6:"strict";b:1;}}s:9:"changelog";a:17:{i:0;a:3:{s:7:"version";s:10:"7.2.13.140";s:7:"content";s:659:"<ul>
<li>В общие настройки магазина добавлена настройка показа элементов подтверждения согласия с политикой обработки персональных данных при написании отзывов о товарах.</li>
<li>В настройку обновления склада добавлен вариант «Не обновляется действиями с заказами», который предполагает полное управления складскими остатками в системе товарного учета.</li>
</ul>";s:8:"datetime";s:19:"2017-07-06 20:24:39";}i:1;a:3:{s:7:"version";s:10:"7.2.12.135";s:7:"content";s:578:"— Добавлены настройки оформления заказа для показа элементов подтверждения согласия с политикой обработки персональных данных при вводе контактных данных и выборе способа доставки. Новые настройки должны поддерживаться темой дизайна. <a href="https://support.webasyst.ru/20302/webasyst-update-2017-personal-data-processing/">Инструкция по настройке</a>.";s:8:"datetime";s:19:"2017-06-29 16:32:05";}i:2;a:3:{s:7:"version";s:10:"7.2.11.129";s:7:"content";s:62:"Исправлены ошибки, связанные с CSRF.";s:8:"datetime";s:19:"2017-05-23 19:17:09";}i:3;a:3:{s:7:"version";s:10:"7.2.10.126";s:7:"content";s:114:"Исправлена ошибка совместимости с плагинами и темами дизайна.";s:8:"datetime";s:19:"2017-05-11 16:57:52";}i:4;a:3:{s:7:"version";s:9:"7.2.9.125";s:7:"content";s:648:"<ul><li>Исправлена ошибка увеличения количества товара на складе при отключении услуги товара во время редактирования заказа.</li><li>Исправлена ошибка восстановления остатка на складе при смене артикула товара во время редактирования заказа.</li><li>Исправлена вставка лишних пустых строк в текст сообщения при использовании функции «Написать клиенту».</li></ul>";s:8:"datetime";s:19:"2017-05-10 18:37:09";}i:5;a:3:{s:7:"version";s:9:"7.2.8.121";s:7:"content";s:174:"Исправлена ошибка при создании заказа на витрине, если товар в корзине был удалён через бекенд.";s:8:"datetime";s:19:"2017-04-19 13:06:28";}i:6;a:3:{s:7:"version";s:9:"7.2.7.118";s:7:"content";s:298:"<ul><li>Улучшение API для работы мобильного приложения.</li>
<li>Исправление ошибки обновления артикулов с характеристиками типа «Значение × Значение (× Значение)».</li></ul>";s:8:"datetime";s:19:"2017-04-11 16:08:42";}i:7;a:3:{s:7:"version";s:9:"7.2.6.117";s:7:"content";s:85:"Доработка API для работы мобильного приложения.";s:8:"datetime";s:19:"2017-03-22 17:06:30";}i:8;a:3:{s:7:"version";s:9:"7.2.5.116";s:7:"content";s:0:"";s:8:"datetime";s:19:"2017-03-22 10:19:04";}i:9;a:3:{s:7:"version";s:9:"7.2.5.115";s:7:"content";s:1164:"<ul> 
<li>Добавлены шаблоны уведомлений для действий с заказами: «Изменены параметры доставки», «Добавлен комментарий к заказу», «Заказ был объединен с другим».</li>
<li>Исправлено списание товаров со склада при оплате заказа, находящегося в пользовательском статусе.</li> 
<li>Исправлена ошибка расчета суммы заказа со скидкой, созданного в бекенде.</li> 
<li>Доработка API для работы мобильного приложения.</li> 
<li>Исправлено обновление основного артикула товара при импорте CSV-файла.</li>
<li>На шаге выбора способа доставки при оформлении заказа плагины теперь используют порядок сортировки полей адреса, установленный в настройках магазина.</li>
</ul>";s:8:"datetime";s:19:"2017-03-14 14:45:38";}i:10;a:3:{s:7:"version";s:9:"7.2.4.114";s:7:"content";s:2243:"<strong>Новые возможности</strong>
<ul>
<li>Настройка назначения курьера в любом статусе заказа с помощью нового действия «Изменить параметры доставки».</li>
<li>Редактирование даты и времени доставки заказа в бекенде магазина.</li>
<li>Сортировка заказов в бекенде по дате и времени доставки и по статусу заказов.</li>
<li>Возможность отправлять триггерные рассылки, только если выбранный статус заказа не изменился.</li>
</ul>

<strong>Исправления</strong>
<ul>
<li>В отчетах исправлено отображение списка заказов для периода, выбранного вручную.</li>
<li>В фильтре товаров в категории исправлен поиск товаров с ценой, указанной в валюте, отличной от валюты витрины.</li>
<li>В фильтре товаров в категории добавлено обновление введенных ограничений цены при смене валюты покупателем.</li>
<li>В настройках витрины добавлено поле для ввода метатега «og:url».</li>
<li>При редактировании заказа с удаленным артикулом добавлен показ сообщения об ошибке.</li>
</ul>

<strong>Мобильное приложение</strong>
<ul>
<li>В списке заказов и на странице выбранного заказа добавлен показ параметров доставки: выбранного курьера, даты и времени доставки заказа.</li>
<li>Добавлено редактирование параметров доставки (выбранного курьера, даты и времени доставки заказа) для выбранного заказа.</li>
</ul>";s:8:"datetime";s:19:"2017-03-06 18:03:24";}i:11;a:3:{s:7:"version";s:9:"7.2.3.109";s:7:"content";s:751:"<strong>Исправлены ошибки:</strong>
<ul>
<li>Исчезновение значений характеристик на странице результатов фильтра в категории после обновления страницы в браузере.</li>
<li>Отсутствие некоторых искомых товаров в результатах фильтра в категории.</li>
<li>Невозможность выбора склада с бесконечным остатком артикула при редактировании заказа.</li>
<li>Неправильное срабатывание правил списания остатков с разных складов.</li>
</ul>";s:8:"datetime";s:19:"2017-02-13 17:28:29";}i:12;a:3:{s:7:"version";s:9:"7.2.2.105";s:7:"content";s:276:"— Улучшен интерфейс просмотра заказа и версия для печати в бекенде.<br/>
— Исправлена вставка изображения заказанного артикула в уведомление о заказе.";s:8:"datetime";s:19:"2017-02-03 17:13:21";}i:13;a:3:{s:7:"version";s:9:"7.2.1.103";s:7:"content";s:196:"— Исправлена работа фильтра в категории при использовании характеристик типа "да/нет переключатель (boolean)".";s:8:"datetime";s:19:"2017-02-02 18:32:43";}i:14;a:3:{s:7:"version";s:9:"7.2.0.102";s:7:"content";s:7844:"<strong>Новые возможности</strong>
<ul>
	<li>Триггерные рассылки:</li>
        <ul>
		<li>настройка задержки отправки в часах в дополнение к дням</li>
		<li>возможность выбора любого статуса заказ, а не только «Оплачен»</li>
		</ul>
	<li>Возможность не отправлять настроенное уведомление при редактировании заказа.</li>
	<li>Отправка информации о курьере в уведомлении о заказе.</li>
	<li>Экспорт и импорт через CSV-файл значение выбора артикула товара по умолчанию.</li>
</ul>

<strong>Исправления</strong>
<ul>
	<li>Улучшение логики списания и возврата товаров на склад при удалении и добавлении товаров в отредактированном заказе.</li>
	<li>Улучшение логики списания и возврата товаров из заказов после удаления старых и добавления новых складов.</li>
	<li>Исправлена фильтрация артикулов для динамических категорий.</li>
	<li>Доработаны редиректы на витрину магазина после оплаты на сайтах платежных систем.</li>
	<li>Исправлен показ квитанции для оплаты для незарегистрированного покупателя.</li>
	<li>Исправлено быстрое редактирование остатков в таблице товаров.</li>
	<li>Устранена возможность удаления системного действия «Написать клиенту».</li>
	<li>При выполнении массовых действий с заказами добавлена возможность выбора пользовательских действий в дополнение к стандартным.</li>
	<li>Исправлено редактирование пользовательского действия с заказами.</li>
	<li>Исправлено сохранение сортировки значений характеристик в категориях товаров.</li>
	<li>Исправлено отображение информации о получателе и плательщике в уведомлениях о заказах.</li>
	<li>Улучшена логика работы с тегами товаров, которые состоят только из цифр.</li>
	<li>Исправлена обработка события при редактировании услуги товара, если в магазине не настроено ни одной услуги.</li>
	<li>Исправлена одновременная фильтрация по характеристике артикула и цене в фильтрах и динамических категориях.</li>
	<li>Улучшена выборка в динамических списках товаров с зачеркнутой ценой.</li>	
	<li>Исправлено обновление суммарной стоимости заказов покупателя.</li>	
	<li>Исправлена локализация в шаблонах уведомлений о заказах.</li>	
</ul>

<strong>Улучшения в бекенде</strong>
<ul>
	<li>Доработана страница с информацией о заказе.</li>
	<li>Исправлена ошибка загрузки больших списков заказов.</li>
	<li>В настройках push-уведомлений удалено устаревшее поле «Google project number».</li>
	<li>Исправлена ссылка на последние заказы на странице просмотра товара.</li>
	<li>Исправлено отображение сообщений об ошибках при редактирование заказа.</li>
	<li>Добавлена блокировка кнопок действий с заказами для предотвращения случайных повторных срабатываний.</li>
	<li>Исправлено отображение фотографий товаров в отчетах о продажах.</li>
	<li>Улучшено удобство ввода названия и кода артикула на странице редактирования товара.</li>
	<li>Доработаны шпаргалки на страницах редактирования уведомлений и триггерных рассылок.</li>
	<li>Улучшена работа меню выбора вариантов сортировки заказов.</li>
	<li>Исправлены ссылки на товары в разделе «Склады».</li>
	<li>Улучшено сохранение дополнительных параметров категорий с HTML-тегами.</li>
	<li>Исправлено отображение списка доступных складов при добавлении виртуального склада.</li>
	<li>Устранено дублирование записей в результатах «живого» поиска товаров в бекенде.</li>
	<li>Добавлены текстовые подсказки для полей цен на странице редактирования товара.</li>
	<li>Добавлена автоматическая прокрутка страницы при нажатии на иконку изменения номера доставки в заказе.</li>
	<li>Улучшен поиск покупателей.</li>
	<li>Улучшен интерфейс редактирования услуг с несколькими вариантами.</li>
</ul>

<strong>Мобильное приложение</strong>
<ul>
	<li>Push-уведомления для курьера отправляются только о назначенных на него заказах.</li>
	<li>Автоматическое обновление прав доступа для пользователей мобильного приложения после редактирования их прав в основном бекенде Webasyst.</li>
	<li>Возможность выхода на странице разрешения доступа к магазину для подключения с другой парой логин/пароль.</li>
	<li>Отображение дополнительных полей адреса покупателя при просмотре информации о заказе.</li>
	<li>Исправлено некорректное отображение сумм в различных валютах.</li>
	<li>На iPhone исправлено добавление фотографий товаров и создание письма по нажатию на email-адрес в информации о заказе.</li>
	<li>Исправлен выбор языка интерфейса для установки — зависит от настройки смартфона.</li>
	<li>Автоматическое обновление содержимого после открытия приложения.</li>
	<li>Визуальное выделение новых заказов.</li>
</ul>";s:8:"datetime";s:19:"2017-02-01 16:24:44";}i:15;a:3:{s:7:"version";s:8:"7.1.6.75";s:7:"content";s:288:"— Исправлена подгрузка в списке заказов в бекенде в соответствии с выбранным фильтром по статусу заказа.<br>
— Исправлен поиск товаров по артикулу в бекенде.";s:8:"datetime";s:19:"2016-09-01 15:29:22";}i:16;a:3:{s:7:"version";s:8:"7.1.5.74";s:7:"content";s:1648:"Исправлены следующие ошибки и проблемы:<br>
— Работа меню сортировки заказов в режиме «Дата обновления».<br>
— Ошибка оформления заказа после удаления плагина доставки или оплаты в случае сохранения настроек такого плагина.<br>
— Неправильный URL изображений в уведомлениях о заказах с витрины, настроенной на «подпапку» домена.<br>
— Ошибочное списание товара со склада после редактирования заказа в статусе, созданном пользователем.<br>
— Неправильное отображение складских остатков при вводе общего значения, без указания раздельных значений для отдельных складов.<br>
— Неправильное обновление счетчика заказов курьера.<br>
— Бесконечное перенаправление на странице товара на витрине магазина, если сайт настроен на «подпапку» домена: domain.ru/shop/.<br>
— Ошибка редактирования шаблона для действия «Написать клиенту» в мобильной версии бекенда.<br>
— Другие мелкие улучшения и исправления недочетов.";s:8:"datetime";s:19:"2016-08-31 14:57:28";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;s:7:"plugins";a:2:{s:3:"seo";a:11:{s:4:"name";s:26:"SEO-оптимизация";s:6:"vendor";i:934303;s:4:"icon";s:68:"//www.webasyst.com/wa-data/public/updates/img/12/1712/icon.ru_RU.png";s:5:"icons";a:1:{i:200;s:76:"//www.webasyst.com/wa-data/public/updates/img/12/1712/icon.200x110.ru_RU.png";}s:10:"commercial";b:1;s:7:"version";s:4:"2.20";s:12:"download_url";s:66:"http://www.webasyst.com/download/archive/wa-apps/shop/plugins/seo/";s:12:"requirements";a:2:{s:8:"app.site";a:3:{s:4:"name";s:33:"Приложение «Сайт»";s:11:"description";s:0:"";s:6:"strict";b:1;}s:8:"app.shop";a:3:{s:4:"name";s:39:"Приложение «Магазин»";s:11:"description";s:0:"";s:6:"strict";b:1;}}s:9:"changelog";a:22:{i:0;a:3:{s:7:"version";s:4:"2.20";s:7:"content";s:506:"— Добавлена проверка минимальной цены в артикулах.
— Добавлена проверка на включеный раздел в персональных шаблонах подстраниц товаров и страниц отзывов о товарах.
— Добавлена проверка на число в запросах по ID товара.
— Добавлено доп. описание в шаблоны товаров категории.";s:8:"datetime";s:19:"2017-08-25 15:34:35";}i:1;a:3:{s:7:"version";s:4:"2.19";s:7:"content";s:514:"— Восстановлена работа шаблонов подстраниц товара.
— Добавлена поддержка старых переменных в шаблонах категорий брендов.
— Исправлена проблема с неверным порядком применения шаблонов категорий/подкатегорий.
— Исправлен вывод URL в редактировании персональных характеристик.";s:8:"datetime";s:19:"2017-08-21 08:54:35";}i:2;a:3:{s:7:"version";s:4:"2.18";s:7:"content";s:225:"— Исправлена проблема с шаблонами страниц тегов для конкретных витрин и массовое редактирование персональных мета-тегов.";s:8:"datetime";s:19:"2017-07-25 15:59:22";}i:3;a:3:{s:7:"version";s:4:"2.17";s:7:"content";s:139:"— Исправлена проблема с шаблонами страниц категорий для конкретных витрин.";s:8:"datetime";s:19:"2017-07-24 11:50:11";}i:4;a:3:{s:7:"version";s:4:"2.16";s:7:"content";s:518:"— Добавлена опция "Номер страницы".
— Теперь, если у товара нет статической категории, то будет искаться наиболее частная динамическая категория.
— Добавлена поддержка переменных SEO-регионов.
— Добавлена возможность получения дополнительных данных из плагина о товаре/категории.";s:8:"datetime";s:19:"2017-07-10 13:13:36";}i:5;a:3:{s:7:"version";s:4:"2.15";s:7:"content";s:479:"— Исправлена ошибка, возникающая при синхронизации с 1C.
— Исправлена проблема с инициализацией Smarty редакторов на странице редактирования категории. 
— Исправлена проблема с отображением настроек подкатегорий и товаров на странице редактирования категории.";s:8:"datetime";s:19:"2017-06-27 10:29:22";}i:6;a:3:{s:7:"version";s:4:"2.14";s:7:"content";s:63:"— Добавлен файл для Smarty редактора;";s:8:"datetime";s:19:"2017-06-25 18:01:11";}i:7;a:3:{s:7:"version";s:4:"2.13";s:7:"content";s:369:"— Добавлена функция удаления персональных значений;
— Добавлена функция редактирования персональных мета-тегов на 1 странице;
— Изменено поведение Tab в визуальном редакторе Smarty;
— Мелкие доработки.";s:8:"datetime";s:19:"2017-06-16 13:03:25";}i:8;a:3:{s:7:"version";s:4:"2.12";s:7:"content";s:101:"— Исправлена проблема с добавлением отзывов к товарам.";s:8:"datetime";s:19:"2017-05-24 20:43:39";}i:9;a:3:{s:7:"version";s:4:"2.11";s:7:"content";s:120:"— Исправлена проблема возникающая при переходе с версий менее 2.6.";s:8:"datetime";s:19:"2017-05-05 18:09:42";}i:10;a:3:{s:7:"version";s:4:"2.10";s:7:"content";s:93:"— Исправлена проблема, приводящая к 500 ошибке сайт.";s:8:"datetime";s:19:"2017-05-04 20:33:54";}i:11;a:3:{s:7:"version";s:3:"2.9";s:7:"content";s:422:"— Исправлены некоторые Notice.
— Добавлена поддержка округления для переменных {$category.min_price} и {$category.max_price}.
— Устранена проблема с порядком родительских категорий.
— Доработана поддержка AJAX-фильтров категории.
— Мелкие доработки.";s:8:"datetime";s:19:"2017-04-28 10:55:47";}i:12;a:3:{s:7:"version";s:3:"2.8";s:7:"content";s:695:"— Добавлена поддержка спец. символов в визуальном редакторе.
— Устранена проблема с поддержкой старых переменных.
— Восстановлена работа переменных {$name}, {$price}, {$summary} в шаблонах товара.
— Восстановлена работа переменных родительских категорий в шаблонах категорий.
— Восстановлена поддержка SEO-фильтра.
— Восстановлена поддержка переменных SEO-регионов.
— Мелкие доработки.";s:8:"datetime";s:19:"2017-04-26 21:26:32";}i:13;a:3:{s:7:"version";s:3:"2.6";s:7:"content";s:316:"— Исправлена критическая ошибка при работе с брендами.
— Исправлен ошибка с категориями товара.
— Исправлены ошибки при обработке старых переменных.
— Мелкие доработки.";s:8:"datetime";s:19:"2017-04-26 08:46:29";}i:14;a:3:{s:7:"version";s:3:"2.5";s:7:"content";s:490:"— Добавлена возможность игнорирования персональных мета-тегов у статических страниц.
— Добавлен шаблон общего дополнительного описания для категорий.
— Добавлен шаблон общего дополнительного описания для товаров.
— Оптимизация работы плагина.
— Мелкие работы.";s:8:"datetime";s:19:"2017-04-25 09:20:56";}i:15;a:3:{s:7:"version";s:3:"2.4";s:7:"content";s:281:"— Добавлена возможность игнорировать персональное описание в категориях и товарах.
— Устранение проблем с производительностью.
— Исправление ошибок.";s:8:"datetime";s:19:"2017-02-06 17:53:55";}i:16;a:3:{s:7:"version";s:3:"2.3";s:7:"content";s:463:"— Исправлена несовместимость со старыми версиями Shop-Script.
— Исправлена работа с персональными OG мета-данными.
— Исправлены ошибки оптимизации страниц других приложений.
— Исправлены ошибки кэша.
— Исправлены проблемы с шаблонами категорий брендов.";s:8:"datetime";s:19:"2017-01-23 20:37:12";}i:17;a:3:{s:7:"version";s:3:"2.2";s:7:"content";s:489:"— Исправлена проблема с заполнением логов.
— Исправлены проблемы с минимальной ценой в категории и добавлена подсказка в список переменных.
— Исправлены проблемы с дополнительным описанием категории.
— Исправлено появление английских слов в интерфейсе плагина.";s:8:"datetime";s:19:"2017-01-10 17:54:05";}i:18;a:3:{s:7:"version";s:3:"2.1";s:7:"content";s:66:"— Добавлено удаление лишних файлов.";s:8:"datetime";s:19:"2016-12-26 17:11:46";}i:19;a:3:{s:7:"version";s:5:"2.0.1";s:7:"content";s:66:"— Исправлена ошибка при обновлении.";s:8:"datetime";s:19:"2016-12-26 15:21:15";}i:20;a:3:{s:7:"version";s:3:"2.0";s:7:"content";s:1950:"<b>Важно! Обязательно проверяйте корректность работы плагина и введенных шаблонов после обновления. </b><br><br>


— Возможность использования шаблонизатора SMARTY в построении шаблонов.<br>
— Возможность создания дополнительных полей для категорий и товаров.<br>
— Возможность построения описания по шаблону для главной страницы.<br>
— Возможность задавать шаблон заголовка H1 для категорий, товаров, тегов и брендов.<br>
— Возможность формировать персональный заголовок H1 для категорий и товаров.<br>
— Возможность формирования шаблонов для категорий «Брендов».<br>
— Возможность формирования описания по шаблону для брендов и его категорий.<br>
— Возможность формирования шаблонов для страниц пагинации «Категорий».<br>
— Возможность формирования шаблонов для страниц «Отзывы о товаре».<br>
— Возможность формирования шаблонов для «Подстраниц товара».<br>
— Возможность персональной оптимизации категорий и товаров для определенной витрины.<br>
— Добавлены новые переменные и модификаторы.<br>
— Оптимизирована скорость работы плагина с большим количеством витрин.<br>";s:8:"datetime";s:19:"2016-12-12 12:20:27";}i:21;a:3:{s:7:"version";s:7:"1.7.1.5";s:7:"content";s:111:"— Исправлен баг переменной «Количество товара в категории».";s:8:"datetime";s:19:"2016-09-02 17:22:53";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}s:9:"seofilter";a:11:{s:4:"name";s:16:"SEO-фильтр";s:6:"vendor";i:934303;s:4:"icon";s:68:"//www.webasyst.com/wa-data/public/updates/img/51/1951/icon.ru_RU.png";s:5:"icons";a:1:{i:200;s:76:"//www.webasyst.com/wa-data/public/updates/img/51/1951/icon.200x110.ru_RU.png";}s:10:"commercial";b:1;s:7:"version";s:3:"2.3";s:12:"download_url";s:72:"http://www.webasyst.com/download/archive/wa-apps/shop/plugins/seofilter/";s:12:"requirements";a:2:{s:8:"app.site";a:3:{s:4:"name";s:33:"Приложение «Сайт»";s:11:"description";s:0:"";s:6:"strict";b:1;}s:8:"app.shop";a:3:{s:4:"name";s:39:"Приложение «Магазин»";s:11:"description";s:0:"";s:6:"strict";b:1;}}s:9:"changelog";a:7:{i:0;a:3:{s:7:"version";s:3:"2.3";s:7:"content";s:104:"— Исправлена проблема с пагинацией.
— Мелкие доработки.";s:8:"datetime";s:19:"2017-08-08 12:59:34";}i:1;a:3:{s:7:"version";s:3:"2.2";s:7:"content";s:1129:"— Исправлена проблема с UTM-метками и произвольными GET-параметрами на страницах плагина.
— Добавлена поддержка новых переменных плагина «SEO-регионы».
— Восстановлена работа дополнительных полей.
— Добавлена возможность автоматической генерации нового URL при редактировании страницы.
— Добавлен шаблон общего дополнительного описания
— Добавлена возможность прописывать шаблон для страниц пагинации.
— Добавлена опция «Номер страницы». 
— Добавлена возможность замена ссылок на прямые на странице брендов.
— Добавлен выбор характеристик для создания в массовой генерации.
— Мелкие доработки и улучшения.";s:8:"datetime";s:19:"2017-07-27 17:05:53";}i:2;a:3:{s:7:"version";s:3:"2.1";s:7:"content";s:848:"— Добавлена возможность настройки прав для вкладки "SEO-фильтр".
— Добавлена поддержка старого стиля ссылок в каталоге.
— Добавлено отображение ценового диапазона при редактировании фильтра.
— Исправлена ошибка при формировании URL плагина "Бренды".
— Поправлены ссылки в пагинации.
— Поправлены ссылки в сортировке товаров.
— Оптимизирована скорость работы плагина.
— Исправлена проблема с переменными {$category.name}, {$category.seo_name}
— Мелкие доработки и улучшения.";s:8:"datetime";s:19:"2017-06-19 17:41:47";}i:3;a:3:{s:7:"version";s:3:"2.0";s:7:"content";s:1614:"<strong>Внимание! При переходе на новую версию сохраняются только те фильтры, в которых были прописаны "SEO-наименования" и сформированы ЧПУ.  </strong><br><br>
— Переработан интерфейс плагина.<br>
— Реализована возможность, создания страниц с любым количеством характеристик.<br>
— Добавлена поддержка характеристик типов select, checkbox, boolean, range (диапазоны).<br>
— Добавлена возможность выбора категорий, в которых будет создана страница.<br>
— Реализована передача URL страницы в Яндекс.Метрику при AJAX-фильтрации.<br>
— Возможность использования шаблонизатора SMARTY в построении шаблонов.<br>
— Добавлены новые переменные и модификаторы.<br>
— Оптимизирована скорость работы плагина с большим количеством витрин.<br>
— Реализована возможность массового создания страниц на основе значений характеристик.<br>
— Добавлено несколько типов URL: короткий (site.ru/category-name/filter-name) и простой (site.ru/category-name/filter/filter-name/).";s:8:"datetime";s:19:"2017-05-26 18:48:46";}i:4;a:3:{s:7:"version";s:3:"1.6";s:7:"content";s:65:"— Совместимость с SEO-оптимизация 2.0.";s:8:"datetime";s:19:"2016-11-02 18:46:48";}i:5;a:3:{s:7:"version";s:3:"1.5";s:7:"content";s:377:"— Исправлена проблема при сохранении настроек.
— Исправлена проблема при совместном использовании любой характеристики и диапазона цен.
— В Sitemap.xml для страниц фильтра добавлена дата изменения страницы.";s:8:"datetime";s:19:"2016-10-12 16:54:19";}i:6;a:3:{s:7:"version";s:3:"1.4";s:7:"content";s:378:"— Исправлена проблема с удалением заведенных характеристик.
— Теперь не меняется URL при изменений SEO-наименования.
— Исправлена проблема, когда пропадало поле с вводом URL при выборе персональных значений.";s:8:"datetime";s:19:"2016-09-21 16:33:42";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}}}s:4:"site";a:11:{s:4:"name";s:8:"Сайт";s:6:"vendor";s:8:"webasyst";s:4:"icon";s:61:"//www.webasyst.com/wa-data/public/updates/img/32/132/icon.png";s:5:"icons";a:4:{i:96;s:67:"//www.webasyst.com/wa-data/public/updates/img/32/132/icon.96x96.png";i:48;s:67:"//www.webasyst.com/wa-data/public/updates/img/32/132/icon.48x48.png";i:24;s:67:"//www.webasyst.com/wa-data/public/updates/img/32/132/icon.24x24.png";i:16;s:67:"//www.webasyst.com/wa-data/public/updates/img/32/132/icon.16x16.png";}s:10:"commercial";b:0;s:7:"version";s:9:"2.2.13.41";s:12:"download_url";s:54:"http://www.webasyst.com/download/archive/wa-apps/site/";s:12:"requirements";a:1:{s:13:"app.installer";a:2:{s:7:"version";s:7:">=1.7.5";s:6:"strict";b:1;}}s:9:"changelog";a:4:{i:0;a:3:{s:7:"version";s:9:"2.2.13.41";s:7:"content";s:87:"Улучшен интерфейс настройки формы регистрации.";s:8:"datetime";s:19:"2017-07-24 13:31:40";}i:1;a:3:{s:7:"version";s:9:"2.2.12.38";s:7:"content";s:87:"Улучшен интерфейс настройки формы регистрации.";s:8:"datetime";s:19:"2017-07-06 19:35:30";}i:2;a:3:{s:7:"version";s:9:"2.2.11.33";s:7:"content";s:468:"Добавлены настройки формы регистрации и обновлен блок формы обратной связи «site.send_email_form» для показа элементов подтверждения согласия с политикой обработки персональных данных. <a href="https://support.webasyst.ru/20302/webasyst-update-2017-personal-data-processing/">Инструкция по настройке</a>.";s:8:"datetime";s:19:"2017-06-29 16:10:11";}i:3;a:3:{s:7:"version";s:9:"2.2.11.32";s:7:"content";s:0:"";s:8:"datetime";s:19:"2017-06-29 15:49:44";}}s:9:"purchased";s:0:"";s:7:"inbuilt";b:0;}s:19:"wa-plugins/shipping";a:1:{s:7:"plugins";a:1:{s:5:"tkkit";a:11:{s:4:"name";s:60:"Расчет стоимости доставки ТК Кит";s:6:"vendor";i:670917;s:4:"icon";s:68:"//www.webasyst.com/wa-data/public/updates/img/91/2091/icon.ru_RU.png";s:5:"icons";a:1:{i:200;s:76:"//www.webasyst.com/wa-data/public/updates/img/91/2091/icon.200x110.ru_RU.png";}s:10:"commercial";b:1;s:7:"version";s:5:"1.4.1";s:12:"download_url";s:67:"http://www.webasyst.com/download/archive/wa-plugins/shipping/tkkit/";s:12:"requirements";a:3:{s:12:"php.mbstring";a:2:{s:11:"description";s:37:"Сравнение Unicode строк";s:6:"strict";b:1;}s:13:"php.simplexml";a:2:{s:11:"description";s:57:"Обработка данных и кэширование";s:6:"strict";b:1;}s:13:"app.installer";a:2:{s:7:"version";s:12:">=1.7.13.168";s:6:"strict";b:1;}}s:9:"changelog";a:3:{i:0;a:3:{s:7:"version";s:5:"1.4.1";s:7:"content";s:43:"Учтены изменения в API ТК";s:8:"datetime";s:19:"2017-08-16 04:05:33";}i:1;a:3:{s:7:"version";s:5:"1.4.0";s:7:"content";s:353:"<ul>
<li>Добавлена печатная форма заявки агенту ТК КиТ</li>
<li>Метод доставки не будет показываться, если город получателя тот же, что и город отправителя (КиТ такое считать не умеет все равно)</li>
</ul>";s:8:"datetime";s:19:"2017-05-07 15:27:18";}i:2;a:3:{s:7:"version";s:5:"1.3.4";s:7:"content";s:135:"Исправлена ошибка с требованием указать регион, если включен расчет по РФ";s:8:"datetime";s:19:"2017-04-26 17:51:51";}}s:9:"purchased";b:1;s:7:"inbuilt";b:0;}}}}}