Repository: situxe/carotics
Catalog: *-apps/shop/plugins/seo/locale/*/LC_MESSAGES/shop_seo.po
Languages: ru_ru

source: SEO
ru_ru: SEO-оптимизация

source: General
ru_ru: Все витрины (Общий шаблон для всех витрин)

source: Settings
ru_ru: Настройки

source: Storefront name
ru_ru: Название витрины

source: storefront name
ru_ru: название витрины

source: page number
ru_ru: номер страницы

source: product price
ru_ru: цена товара

source: product sku
ru_ru: артикул товара

source: Ignore title
ru_ru: Игнорировать персональные заголовки

source: Ignore meta title keywords description
ru_ru: Персональные значения Title, META Keywords, META Description будут перекрыты настройками указанными в настройках плагина

source: Main page
ru_ru: Главная страница

source: Category page
ru_ru: Страницы категорий

source: Subcategory page
ru_ru: Страницы подкатегорий

source: Product page
ru_ru: Страницы товаров

source: Static page
ru_ru: Статические страницы

source: Tag page
ru_ru: Страницы тегов

source: Brand page
ru_ru: Страницы брендов

source: Title
ru_ru: Заголовок

source: Description
ru_ru: Описание

source: Variables
ru_ru: Переменные

source: Category description
ru_ru: Описание категории

source: store name
ru_ru: название магазина

source: store phone
ru_ru: телефон магазина

source: category name
ru_ru: название категории

source: category SEO name
ru_ru: SEO название категории

source: parent category name
ru_ru: название родительской категории

source: products count
ru_ru: количество товаров

source: product name
ru_ru: название товара

source: product SEO name
ru_ru: SEO название товара

source: root category name
ru_ru: название корневой категории

source: root category SEO name
ru_ru: SEO название корневой категории

source: page name
ru_ru: название страницы

source: tag name
ru_ru: название тега

source: brand name
ru_ru: название бренда

source: SEO name
ru_ru: SEO Название

source: Storefronts
ru_ru: Витрины

source: SEO subcategory page
ru_ru: SEO оптимизация страниц подкатегорий

source: SEO product page
ru_ru: SEO оптимизация страниц товаров

source: Fast and flexible optimization of your shop
ru_ru: Быстрая и гибкая оптимизация вашего магазина

source: Enable subcategories rules
ru_ru: Включить возможность формирования правил для подкатегорий

source: Enable products rules
ru_ru: Включить возможность указывать правила для товаров определенной категории

source: Enable seo name for h1 categories
ru_ru: Использовать альтернативные названия для категорий в качестве заголовка h1 если они заполнены

source: Enable seo name for h1 products
ru_ru: Использовать альтернативные названия для товаров в качестве заголовка h1 если они заполнены

source: Plugin status
ru_ru: Статус плагина

source: On
ru_ru: Включён

source: Off
ru_ru: Выключен

source: Save
ru_ru: Сохранить

source: Saved
ru_ru: Сохранено

source: Options plugin
ru_ru: Опции плагина

source: General settings
ru_ru: Общие настройки формирования мета-тегов и описаний для витрин

source: lower case
ru_ru: преобразует в нижний регистр

source: currency
ru_ru: преобразует число в денежный формат

source: if page not first
ru_ru: преобразует в пустую строку если страница первая

source: if page first
ru_ru: преобразует в пустую строку если страница не первая

source: min price
ru_ru: минимальная цена в категории

source: Modifiers
ru_ru: Модификаторы

source: Help
ru_ru: Помощь

source: Was change address
ru_ru: Был изменён адрес витрины

source: What doing with settings?
ru_ru: Что делать с настройками витрины?

source: Delete
ru_ru: Удалить

source: Transfer to other storefront
ru_ru: Перенести на другую витрину

source: Close
ru_ru: Закрыть

source: delete
ru_ru: удалить

source: Field
ru_ru: Поле

source: New field
ru_ru: Новое поле

source: Add field
ru_ru: Добавить поле

source: Additional fields
ru_ru: Дополнительные поля для витрин

source: Select storefront
ru_ru: Выберите витрину

source: categories path
ru_ru: путь до категории

source: parent categories
ru_ru: путь до категории

source: if product page is open
ru_ru: преобразует в пустую строку если не открыта страница товара

source: if brand category is open
ru_ru: преобразует в пустую строку если не открыта категория бренда

source: Enable category additional description
ru_ru: Включить поле дополнительного описания категории

source: Category additional description
ru_ru: Дополнительное описание категории

source: Additional description
ru_ru: Дополнительное описание

source: Product description
ru_ru: Описание товара

source: Info
ru_ru: Информация

source: Support
ru_ru: Поддержка

source: Review
ru_ru: Оставить отзыв

source: Developer
ru_ru: Разработчик

source: Loading
ru_ru: Загрузка

source: Error
ru_ru: Ошибка

source: For output insert code
ru_ru: Для вывода вставьте код

source: in
ru_ru: в
